AccountDev-Design/Flex-OS-Ecosistema/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y

# --- ESP-Hosted: el P4 no tiene radio, el C6 hace de "modem" WiFi/BT ---
# conectado por SDIO (bus de la SD, pero dedicado solo al C6, no hay
# tarjeta SD fisica en ese bus).
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000

# Pines SDIO segun el esquematico JC4880P443_V1.0 (hoja "3_ESP32-P4"):
#   SD_CLK   -> GPIO44
#   SD_CMD   -> GPIO41
#   SD_DATA0 -> GPIO39
#   SD_DATA1 -> GPIO40
#   SD_DATA2 -> GPIO42
#   SD_DATA3 -> GPIO43
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=44
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=41
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=39
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=40
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=42
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=43

# No se identifico un GPIO dedicado del P4 que resetee al C6 (en tu placa
# el pin "C6_CHIP_PU" se ve alimentado por una red RC propia, R81+C64,
# no por un GPIO del P4). Si el enlace no sube al primer intento, prueba
# a activar esta opcion apuntando al GPIO real que confirmes con el
# fabricante o con un multimetro (continuidad hasta el pin CHIP_PU del C6):
# CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=<GPIO_del_P4>

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
